app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]
---
  def create
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to new_song_path, alert: "Artist not found."
    else
      @song = Song.new(song_params)
    end

    if @song.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ?  ORDER BY "artists"."id" ASC LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ?  ORDER BY "songs"."id" ASC LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
    if params[:artist_id]
      @nested = true
      artist = Artist.where(id: params[:artist_id]).first
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = artist.songs.where(id: params[:id]).first